Config/Catalogs/ПриемыПищи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПриемыПищи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХронологическийПорядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/КатегорииДовольствующихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КатегорииДовольствующихся</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантМеню</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыМеню</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПерсонал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПриемыПищи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриемПищи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриемыПищи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсточникиСредств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПСЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭКЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗатрат1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗатрат2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗатрат3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ПриемыПищи/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает в пустом справочнике элементы Завтрак, Обед, Ужин.
// Вызывается при первоначальном заполнении
//
Процедура ЗаполнитьПоУмолчанию() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПриемыПищи.Ссылка
	                      |ИЗ
	                      |	Справочник.ПриемыПищи КАК ПриемыПищи");
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		ПриемПищи = Справочники.ПриемыПищи.СоздатьЭлемент();
		ПриемПищи.Наименование = "Завтрак";
		ПриемПищи.Записать();
		
		ПриемПищи = Справочники.ПриемыПищи.СоздатьЭлемент();
		ПриемПищи.Наименование = "Обед";
		ПриемПищи.Записать();
		
		ПриемПищи = Справочники.ПриемыПищи.СоздатьЭлемент();
		ПриемПищи.Наименование = "Ужин";
		ПриемПищи.Записать();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Перем КатегорияДовольствующихся;
	Перем СтрокаПоиска;
	
	Если Параметры.Отбор.Свойство("КатегорияДовольствующихся", КатегорияДовольствующихся)
		И ЗначениеЗаполнено(КатегорияДовольствующихся) Тогда
		СтандартнаяОбработка = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 51
		|	ПриемыПищи.Ссылка,
		|	ПриемыПищи.Код,
		|	ПриемыПищи.Наименование
		|ИЗ
		|	Справочник.ПриемыПищи КАК ПриемыПищи
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА КАК Поле1
		|			ИЗ
		|				Справочник.КатегорииДовольствующихся.ПриемыПищи КАК КатегорииДовольствующихсяПриемыПищи
		|			ГДЕ
		|				КатегорииДовольствующихсяПриемыПищи.Ссылка = &КатегорияДовольствующихся
		|				И КатегорииДовольствующихсяПриемыПищи.Используется = ИСТИНА
		|				И КатегорииДовольствующихсяПриемыПищи.ПриемПищи = ПриемыПищи.Ссылка)
		|	И &УсловиеСтрокаПоиска
		|АВТОУПОРЯДОЧИВАНИЕ";
		Если Параметры.Свойство("СтрокаПоиска", СтрокаПоиска) И ЗначениеЗаполнено(СтрокаПоиска) Тогда
			Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска + "%");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтрокаПоиска", "ПриемыПищи.Наименование ПОДОБНО &СтрокаПоиска");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтрокаПоиска", "ИСТИНА");
		КонецЕсли;
		Запрос.УстановитьПараметр("КатегорияДовольствующихся", КатегорияДовольствующихся);
		ДанныеВыбора = Новый СписокЗначений;
		Если Параметры.Свойство("ПолучатьКодИСсылку") Тогда
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ДанныеВыбора.Добавить(Новый Структура("Код, Ссылка", Выборка.Код, Выборка.Ссылка), Выборка.Наименование);
			КонецЦикла;
		Иначе
			ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти

#КонецЕсли
